/*
Старинная задача. 
Сколько можно купить быков, коров и телят, если плата за быка 10 рублей, за корову — 5 рублей, за теленка — полтинник (0.5 рубля), если на 100 рублей надо купить 100 голов скота.
*/

function oldTask() {
  var b, k, t;
  for (b = 0; b < 10; b++) {
    for (k = 0; k < 20; k++) {
      t = 100 - (b + k);
      if (20 * b + 10 * k + t == 200 && b + k + t == 100) {
        console.log("b= ", b, "\n", "k= ", k, "\n", "t= ", t);
      }
    }
  }
}

module.exports = {
  oldTask,
};
